//A选手说：B第二，我第三；      B = 2, A = 3 
//B选手说：我第二，E第四；      B = 2, E = 4
//C选手说：我第一，D第二；      C = 1, D = 2
//D选手说：C最后，我第三；      C = 5, D = 3
//E选手说：我第四，A第一；      E = 4, A = 1

#include <stdio.h>

int main()
{
    int A = 0, B = 0, C = 0, D = 0, E = 0;
    for (A = 1; A < 6; A++)
    {
        for (B = 1; B < 6; B++)
        {
            for( C = 1; C < 6; C++)
            {
                for (D = 1; D < 6; D++)
                {
                    for (E = 1; E < 6; E++)
                    {
                        if (((B == 2) + (A == 3) == 1) &&
                            ((B == 2) + (E == 4) == 1) &&
                            ((C == 1) + (D == 2) == 1) &&
                            ((C == 5) + (D == 3) == 1) &&
                            ((E == 4) + (A == 1) == 1))
                        {
                            if (A * B * C * D * E == 120)
                            {
                                printf("A = %d,B = %d, C = %d, D = %d, E = %d\n", A, B, C, D, E);
                            }
                        }
                    }
                }
            }
        }
    }

    return 0;
}